SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Bootloader/Device/MM32F5370/HAL_Lib/inc/hal_qspi.h
/***********************************************************************************************************************
    @file     hal_qspi.h
    @author   VV TEAM
    @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE QSPI FIRMWARE LIBRARY.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __HAL_QSPI_H
#define __HAL_QSPI_H

/* Files includes ------------------------------------------------------------*/
#include "mm32_device.h"

/** @addtogroup MM32_StdPeriph_Driver
  * @{
  */

/** @defgroup QSPI
  * @{
  */

/** @defgroup QSPI_Exported_Types
  * @{
  */

/**
  * @brief  QSPI Init structure definition
  */
typedef struct
{
    uint32_t ClockPrescaler;          /* Specifies the prescaler factor for generating clock based on the AHB clock. */
    uint32_t NssHighLevelHold;        /* Set the high level hold time of the chip select signal twice.*/ 
    uint32_t ModeSelection;           /* Specifies the Clock Mode. It indicates the level that clock takes between commands. */
}QSPI_InitTypeDef;

/** 
  * @brief  QSPI_Command structure definition  
  */
typedef struct
{
    uint8_t     InstructionCode;       /*!<Instruction Code */
    uint32_t    InstructPhaseMode;     /*!<Instruction Phase Mode */
    uint32_t    AddressPhaseMode;      /*!<Address Phase Mode */
    uint32_t    AddressPhaseSize;      /*!<Address Phase Size */
    uint32_t    AltBytesPhaseMode;     /*!<Alternate Bytes Phase Mode */
    uint32_t    AltBytesPhaseSize;     /*!<Alternate Bytes Phase Size */
    uint32_t    DataPhaseMode;         /*!<Data Phase Mode */
    uint32_t    DataPhaseSize;         /*!<Data Phase Size */
    uint32_t    RxSampleDelayCycles;   /*!<Delay AHB_CLK Cycles when Sample the Input Data */
    uint32_t    DummyPhaseCycles;      /*!<QSPI SCK Cycles at Dummy Phase */
    uint32_t    AltBytesValue;         /*!<Alternate Bytes */
} QSPI_CommonConfig_TypeDef;

/**
  * @brief  QSPI Indirect externd config structure definition
  */
typedef struct
{
    uint32_t  address;             /*!<Indirect mode address */
    uint32_t  length;              /*!<Indirect mode data length */
    uint32_t  count;               /*!<Indirect mode wait count */
} QSPI_IndirectExtendConfig_TypeDef;

/**
  * @}
  */

/** @defgroup QSPI_Exported_Constants
  * @{
  */

/**
  * @brief  Delay Cycles when Sample the Input Data
  */
#define QSPI_DelayCycles_0                   (0x00U << QSPI_DMCR_RXDLY_Pos)  /*!<No sampling delay */
#define QSPI_DelayCycles_1                   (0x01U << QSPI_DMCR_RXDLY_Pos)  /*!<Add 1 sampling delay for AHB_CLK */
#define QSPI_DelayCycles_2                   (0x02U << QSPI_DMCR_RXDLY_Pos)  /*!<Add 2 sampling delays for AHB_CLK */
#define QSPI_DelayCycles_3                   (0x03U << QSPI_DMCR_RXDLY_Pos)  /*!<Add 3 sampling delays for AHB_CLK */

/**
  * @brief  QSPI Operation Mode Select
  */
#define QSPI_OperationMode_Direct            (0x00U << QSPI_CR_OPMODE_Pos)   /*!<Direct mode*/
#define QSPI_OperationMode_Reserved          (0x01U << QSPI_CR_OPMODE_Pos)   /*!<Reserved */
#define QSPI_OperationMode_Indirect          (0x02U << QSPI_CR_OPMODE_Pos)   /*!<Indirect mode */
#define QSPI_OperationMode_Inactive          (0x03U << QSPI_CR_OPMODE_Pos)   /*!<Inactive mode */

/**
  * @brief  QSPI Data Phase Size
  */
#define QSPI_DataPhaseSize_8Bit              (0x00U << QSPI_DMCR_DSIZE_Pos)  /*!<8bit */
#define QSPI_DataPhaseSize_16Bit             (0x01U << QSPI_DMCR_DSIZE_Pos)  /*!<16bit */
#define QSPI_DataPhaseSize_24Bit             (0x02U << QSPI_DMCR_DSIZE_Pos)  /*!<24bit */
#define QSPI_DataPhaseSize_32Bit             (0x03U << QSPI_DMCR_DSIZE_Pos)  /*!<32bit */

/**
  *  @brief  QSPI Data Phase Mode
  */
#define QSPI_DataPhaseMode_None              (0x00U << QSPI_DMCR_DMODE_Pos)  /*!<Reserved */
#define QSPI_DataPhaseMode_Single            (0x01U << QSPI_DMCR_DMODE_Pos)  /*!<Single-wire type */
#define QSPI_DataPhaseMode_Dual              (0x02U << QSPI_DMCR_DMODE_Pos)  /*!<Two-wire type */
#define QSPI_DataPhaseMode_Quad              (0x03U << QSPI_DMCR_DMODE_Pos)  /*!<Four-wire type */

/**
  * @brief Alternate Byte Phase Size
  */
#define QSPI_AltBytePhaseSize_8Bit           (0x00U << QSPI_DMCR_ABSIZE_Pos) /*!<8bit */
#define QSPI_AltBytePhaseSize_16Bit          (0x01U << QSPI_DMCR_ABSIZE_Pos) /*!<16bit */
#define QSPI_AltBytePhaseSize_24Bit          (0x02U << QSPI_DMCR_ABSIZE_Pos) /*!<24bit */
#define QSPI_AltBytePhaseSize_32Bit          (0x03U << QSPI_DMCR_ABSIZE_Pos) /*!<32bit */

/**
  * @brief  Alternate Byte Phase Mode
  */
#define QSPI_AltBytePhaseMode_None           (0x00U << QSPI_DMCR_ABMODE_Pos) /*!<No alternate byte phase */
#define QSPI_AltBytePhaseMode_Single         (0x01U << QSPI_DMCR_ABMODE_Pos) /*!<Single-wire type */
#define QSPI_AltBytePhaseMode_Dual           (0x02U << QSPI_DMCR_ABMODE_Pos) /*!<Two-wire type */
#define QSPI_AltBytePhaseMode_Quad           (0x03U << QSPI_DMCR_ABMODE_Pos) /*!<Four-wire type */

/**
  * @brief  QSPI Address Phase Size
  */
#define QSPI_AddressPhaseSize_8Bit           (0x00U << QSPI_DMCR_ADSIZE_Pos) /*!<Reserved */
#define QSPI_AddressPhaseSize_16Bit          (0x01U << QSPI_DMCR_ADSIZE_Pos) /*!<Reserved */
#define QSPI_AddressPhaseSize_24Bit          (0x02U << QSPI_DMCR_ADSIZE_Pos) /*!<24bit */
#define QSPI_AddressPhaseSize_32Bit          (0x03U << QSPI_DMCR_ADSIZE_Pos) /*!<32bit */

/**
  * @brief  QSPI Address Phase Mode
  */
#define QSPI_AddressPhaseMode_None           (0x00U << QSPI_DMCR_ADMODE_Pos) /*!<No-address phase */
#define QSPI_AddressPhaseMode_Single         (0x01U << QSPI_DMCR_ADMODE_Pos) /*!<Single-wire type */
#define QSPI_AddressPhaseMode_Dual           (0x02U << QSPI_DMCR_ADMODE_Pos) /*!<Two-wire type */
#define QSPI_AddressPhaseMode_Quad           (0x03U << QSPI_DMCR_ADMODE_Pos) /*!<Four-wire type */

/**
  * @brief  QSPI Instruction Phase Mode
  */
#define QSPI_InstructPhaseMode_None          (0x00U << QSPI_DMCR_IMODE_Pos)  /*!<No-instruction phase */
#define QSPI_InstructPhaseMode_Single        (0x01U << QSPI_DMCR_IMODE_Pos)  /*!<Single-wire type */
#define QSPI_InstructPhaseMode_Dual          (0x02U << QSPI_DMCR_IMODE_Pos)  /*!<Two-wire type */
#define QSPI_InstructPhaseMode_Quad          (0x03U << QSPI_DMCR_IMODE_Pos)  /*!<Four-wire type */

/**
  * @brief  QSPI Indirect Mode Access
  */
#define QSPI_IndirectModeAccess_Read         (0x00U << QSPI_IMCR_IDMODE_Pos) /*!<Read access */
#define QSPI_IndirectModeAccess_Write        (0x01U << QSPI_IMCR_IDMODE_Pos) /*!<Write access */

/**
  * @brief  SPI Mode Select
  */
#define QSPI_MODE_0                          (0x00U << QSPI_CR_SCKMODE_Pos) /*!<Mode 0 */
#define QSPI_MODE_3                          (0x01U << QSPI_CR_SCKMODE_Pos) /*!<Mode 3 */

/**
  * @brief  QSPI DMA Request
  */
#define QSPI_DMA_TCF                         (0x01U << QSPI_IDER_TCFDMAEN_Pos)   /*!<Transfer Complete */
#define QSPI_DMA_EMPTY                       (0x01U << QSPI_IDER_EMPTYDMAEN_Pos) /*!<FIFO Empty */
#define QSPI_DMA_FULL                        (0x01U << QSPI_IDER_FULLDMAEN_Pos)  /*!<FIFO Full */

/**
  * @brief  QSPI Status flag
  */
#define QSPI_FLAG_TCF                        (0x01U << QSPI_SR_TCF_Pos)          /*!<Transfer Complete */
#define QSPI_FLAG_EMPTY                      (0x01U << QSPI_SR_EMPTY_Pos)        /*!<FIFO Empty */
#define QSPI_FLAG_FULL                       (0x01U << QSPI_SR_FULL_Pos)         /*!<FIFO Full */
#define QSPI_FLAG_BUSY                       (0x01U << QSPI_SR_BUSY_Pos)         /*!<Busy status */
#define QSPI_FLAG_XIP                        (0x01U << QSPI_SR_XIPST_Pos)        /*!<XIP status */
#define QSPI_FLAG_MODECHANGE                 (0x01U << QSPI_SR_OPCRCF_Pos)
 
/**
  * @brief  QSPI interrupts definition  
  */
#define QSPI_IT_TCF                          (0x01U << QSPI_IDER_TCFINTEN_Pos)   /*!<Transfer Complete */
#define QSPI_IT_EMPTY                        (0x01U << QSPI_IDER_EMPTYINTEN_Pos) /*!<FIFO Empty */
#define QSPI_IT_FULL                         (0x01U << QSPI_IDER_FULLINTEN_Pos)  /*!<FIFO Full */

/**
  * @brief QSPI_XIPMode QSPI XIP Mode
  */
#define QSPI_XIP_Disable                     0x00U                               /*!<XIP mode disable*/
#define QSPI_XIP_Enable                      0x01U                               /*!<XIP mode enable*/
                                                                                
/**                                                                             
  * @brief QSPI_ClockPrescaler QSPI prescaler                                   
  */                                                                            
#define QSPI_Prescaler_2                     (0x00U << QSPI_CR_SCKDIV_Pos)       /*!<AHB clock divided by 2 as QSPI clock*/
#define QSPI_Prescaler_4                     (0x01U << QSPI_CR_SCKDIV_Pos)       /*!<AHB clock divided by 4 as QSPI clock*/
#define QSPI_Prescaler_6                     (0x02U << QSPI_CR_SCKDIV_Pos)       /*!<AHB clock divided by 6 as QSPI clock*/
#define QSPI_Prescaler_8                     (0x03U << QSPI_CR_SCKDIV_Pos)       /*!<AHB clock divided by 8 as QSPI clock*/
#define QSPI_Prescaler_16                    (0x07U << QSPI_CR_SCKDIV_Pos)       /*!<AHB clock divided by 16 as QSPI clock*/
#define QSPI_Prescaler_32                    (0x0FU << QSPI_CR_SCKDIV_Pos)       /*!<AHB clock divided by 32 as QSPI clock*/
#define QSPI_Prescaler_64                    (0x1FU << QSPI_CR_SCKDIV_Pos)       /*!<AHB clock divided by 64 as QSPI clock*/
#define QSPI_Prescaler_128                   (0x3FU << QSPI_CR_SCKDIV_Pos)       /*!<AHB clock divided by 128 as QSPI clock*/
                                                                                
/**
  * @brief QSPI_ChipSelectHighTime QSPI Chip Select High Time
  */
#define QSPI_CS_HIGH_TIME_AHB_2              (0x00U << QSPI_CR_CSRHT_Pos)        /*!<nCS stay high for at least 2 AHB clock cycle between commands*/
#define QSPI_CS_HIGH_TIME_AHB_3              (0x01U << QSPI_CR_CSRHT_Pos)        /*!<nCS stay high for at least 3 AHB clock cycles between commands*/
#define QSPI_CS_HIGH_TIME_AHB_4              (0x02U << QSPI_CR_CSRHT_Pos)        /*!<nCS stay high for at least 4 AHB clock cycles between commands*/
#define QSPI_CS_HIGH_TIME_AHB_5              (0x03U << QSPI_CR_CSRHT_Pos)        /*!<nCS stay high for at least 5 AHB clock cycles between commands*/
#define QSPI_CS_HIGH_TIME_AHB_6              (0x04U << QSPI_CR_CSRHT_Pos)        /*!<nCS stay high for at least 6 AHB clock cycles between commands*/
#define QSPI_CS_HIGH_TIME_AHB_7              (0x05U << QSPI_CR_CSRHT_Pos)        /*!<nCS stay high for at least 7 AHB clock cycles between commands*/
#define QSPI_CS_HIGH_TIME_AHB_8              (0x06U << QSPI_CR_CSRHT_Pos)        /*!<nCS stay high for at least 8 AHB clock cycles between commands*/
#define QSPI_CS_HIGH_TIME_AHB_9              (0x07U << QSPI_CR_CSRHT_Pos)        /*!<nCS stay high for at least 9 AHB clock cycles between commands*/

/**
  * @brief  QSPI Indirect Mode Access
  */
#define QSPI_IndirectMode_Read               (0x00U << QSPI_IMCR_IDMODE_Pos)      /*!<Read access */
#define QSPI_IndirectMode_Write              (0x01U << QSPI_IMCR_IDMODE_Pos)      /*!<Write access */

/**
  * @}
  */

/** @defgroup QSPI_Exported_Functions
  * @{
  */
void QSPI_DeInit(QSPI_TypeDef *qspi);
void QSPI_StructInit(QSPI_InitTypeDef *init_struct);
void QSPI_Init(QSPI_TypeDef *qspi, QSPI_InitTypeDef *init_struct);
void QSPI_CommonConfigStructInit(QSPI_CommonConfig_TypeDef *init_struct);
void QSPI_DirectInit(QSPI_TypeDef *qspi, QSPI_CommonConfig_TypeDef *init_struct);
void QSPI_IndirectInit(QSPI_TypeDef *qspi, QSPI_CommonConfig_TypeDef *init_struct, QSPI_IndirectExtendConfig_TypeDef *extendconfig, uint32_t accessmode);
void QSPI_InactiveInit(QSPI_TypeDef *qspi);
void QSPI_DirectEnterXIPCmd(QSPI_TypeDef *qspi, FunctionalState state);
void QSPI_IndirectEnterXIPCmd(QSPI_TypeDef *qspi, FunctionalState state);
void QSPI_XIPFromIndirectCmd(QSPI_TypeDef *qspi, FunctionalState state);
void QSPI_SetOperationMode(QSPI_TypeDef *qspi, uint32_t mode);
uint32_t QSPI_GetOperationMode(QSPI_TypeDef *qspi);
uint32_t QSPI_GetFifoLevel(QSPI_TypeDef *qspi);
uint32_t QSPI_GetFifoDepth(QSPI_TypeDef *qspi);
void QSPI_SetDirectAlternateBytes(QSPI_TypeDef *qspi, uint32_t data);
uint32_t QSPI_GetDirectAlternateBytes(QSPI_TypeDef *qspi);
void QSPI_SetIndirectAlternateBytes(QSPI_TypeDef *qspi, uint32_t data);
uint32_t QSPI_GetIndirectAlternateBytes(QSPI_TypeDef *qspi);
void QSPI_SetIndirectAddress(QSPI_TypeDef *qspi, uint32_t data);
uint32_t QSPI_GetIndirectAddress(QSPI_TypeDef *qspi);
void QSPI_SetIndirectDataLength(QSPI_TypeDef *qspi, uint32_t length);
uint32_t QSPI_GetIndirectDataLength(QSPI_TypeDef *qspi);
void QSPI_SetIndirectWaitCount(QSPI_TypeDef *qspi, uint32_t count);
uint32_t QSPI_GetIndirectWaitCount(QSPI_TypeDef *qspi);
void QSPI_SendIndirectDataFifo(QSPI_TypeDef *qspi, uint32_t data);
uint32_t QSPI_ReceiveIndirectDataFifo(QSPI_TypeDef *qspi);

FlagStatus QSPI_GetFlagStatus(QSPI_TypeDef *qspi, uint32_t flag);
void QSPI_ClearFlag(QSPI_TypeDef *qspi, uint32_t flag);
void QSPI_ITConfig(QSPI_TypeDef *qspi, uint32_t it, FunctionalState state);
void QSPI_DMAConfig(QSPI_TypeDef *qspi, uint32_t dmaconfig, FunctionalState state);
void QSPI_SetIndirectTransMode(QSPI_TypeDef *qspi, uint32_t direction);

#endif

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
